{
    "format": "layers-model",
    "generatedBy": "keras v2.13.1",
    "convertedBy": "TensorFlow.js Converter v4.11.0",
    "modelTopology": {
        "keras_version": "2.13.1",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                32,
                                32,
                                32,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        },
                        "name": "input_1",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d",
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_1",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_1",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_1",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling3D",
                        "config": {
                            "name": "max_pooling3d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling3d",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_2",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling3d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_2",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_2",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_2",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_3",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_3",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_3",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_3",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling3D",
                        "config": {
                            "name": "max_pooling3d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling3d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_4",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_4",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling3d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_4",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_4",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_4",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_4",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_5",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_5",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_5",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_5",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_5",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_5",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling3D",
                        "config": {
                            "name": "max_pooling3d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling3d_2",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_6",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_6",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling3d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_6",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_6",
                        "inbound_nodes": [
                            [
                                [
                                    "conv3d_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_6",
                            "trainable": true,
                            "dtype": "float32",
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_6",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv3D",
                        "config": {
                            "name": "conv3d_7",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv3d_7",
                        "inbound_nodes": [
                            [
                                [
                                    "re_lu_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_7",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                4
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
